<a href="https://colab.research.google.com/github/ylpulgar/LP_cursos/blob/main/a_stats.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:

# importaciones comunes
import os
import io
import numpy as np
import pandas as pd
import seaborn as sns
import numpy as np
from datetime import datetime


# importacion para visualizacion
%matplotlib inline
import matplotlib as mpl
import matplotlib.pyplot as plt
mpl.rc('axes', labelsize=14)
mpl.rc('xtick', labelsize=12)
mpl.rc('ytick', labelsize=12)

In [2]:
#Selecciona el archivo de csv desde la ubicaci√≥n en tu pc
from google.colab import files
uploaded = files.upload()

Saving supermarket_sales.csv to supermarket_sales.csv

In [3]:
print (uploaded['supermarket_sales.csv'][:200].decode('utf-8') + '...')

Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
750-67-8428,A,Yangon,Member,Female,Health ...

In [4]:
#Crea un dataframe en pandas con el archivo de csv
df_super = pd.read_csv(io.StringIO(uploaded['supermarket_sales.csv'].decode('utf-8')))

In [ ]:
# Si ya tienes la base de datos y deseas trabajar desde Jupyter puedes importarla con este codigo
#df_Listings = pd.read_csv("/Users/lorenapulgarin/Documents/Listings.csv",encoding='latin1')

In [5]:
df_super.head()

    Invoice ID Branch       City  ... gross margin percentage gross income Rating
0  750-67-8428      A     Yangon  ...                4.761905      26.1415    9.1
1  226-31-3081      C  Naypyitaw  ...                4.761905       3.8200    9.6
2  631-41-3108      A     Yangon  ...                4.761905      16.2155    7.4
3  123-19-1176      A     Yangon  ...                4.761905      23.2880    8.4
4  373-73-7910      A     Yangon  ...                4.761905      30.2085    5.3

[5 rows x 17 columns]

Importacio√≥n de la base de datos a un dataframe en pandas

In [6]:
#realiza una pequen√±a tabla de contenido de todas las columnas y el tipo de columnas
df_super.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 17 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Invoice ID               1000 non-null   object
 1   Branch                   1000 non-null   object
 2   City                     1000 non-null   object
 3   Customer type            1000 non-null   object
 4   Gender                   1000 non-null   object
 5   Product line             1000 non-null   object
 6   Unit price               1000 non-null   float64
 7   Quantity                 1000 non-null   int64
 8   Tax 5%                   1000 non-null   float64
 9   Total                    1000 non-null   float64
 10  Date                     1000 non-null   object
 11  Time                     1000 non-null   object
 12  Payment                  1000 non-null   object
 13  cogs                     1000 non-null   float64
 14  gross margin percentage  1000 non-null   float64
 15  gross income             1000 non-null   float64
 16  Rating                   1000 non-null   float64
dtypes: float64(7), int64(1), object(9)
memory usage: 132.9+ KB

In [7]:
#Separa el dataframe en variables numericas y categoricas
numeric_data = df_super.select_dtypes(include=[np.number])
categorical_data = df_super.select_dtypes(exclude=[np.number])

numeric_data.shape[1]
categorical_data.shape[1]

9

In [8]:
numeric_data.head()

   Unit price  Quantity   Tax 5%  ...  gross margin percentage  gross income  Rating
0       74.69         7  26.1415  ...                 4.761905       26.1415     9.1
1       15.28         5   3.8200  ...                 4.761905        3.8200     9.6
2       46.33         7  16.2155  ...                 4.761905       16.2155     7.4
3       58.22         8  23.2880  ...                 4.761905       23.2880     8.4
4       86.31         7  30.2085  ...                 4.761905       30.2085     5.3

[5 rows x 8 columns]

In [9]:
categorical_data.head()

    Invoice ID Branch       City  ...       Date   Time      Payment
0  750-67-8428      A     Yangon  ...   1/5/2019  13:08      Ewallet
1  226-31-3081      C  Naypyitaw  ...   3/8/2019  10:29         Cash
2  631-41-3108      A     Yangon  ...   3/3/2019  13:23  Credit card
3  123-19-1176      A     Yangon  ...  1/27/2019  20:33      Ewallet
4  373-73-7910      A     Yangon  ...   2/8/2019  10:37      Ewallet

[5 rows x 9 columns]

In [10]:
#Realiza una tabla de sumarizaci√≥n a los campos num√©ricos(No distingue discretas y continuas)
numeric_data.describe()

        Unit price     Quantity  ...  gross income      Rating
count  1000.000000  1000.000000  ...   1000.000000  1000.00000
mean     55.672130     5.510000  ...     15.379369     6.97270
std      26.494628     2.923431  ...     11.708825     1.71858
min      10.080000     1.000000  ...      0.508500     4.00000
25%      32.875000     3.000000  ...      5.924875     5.50000
50%      55.230000     5.000000  ...     12.088000     7.00000
75%      77.935000     8.000000  ...     22.445250     8.50000
max      99.960000    10.000000  ...     49.650000    10.00000

[8 rows x 8 columns]

In [ ]:
#Una operaci√≥n de grupo implica una combinaci√≥n de dividir el objeto, aplicar una funci√≥n y combinar los resultados. Esto se puede utilizar para agrupar grandes cantidades de datos y calcular operaciones en estos grupos.
categorical_data.loc[:,('Invoice ID','Customer type')].groupby(['Customer type']).count()

               Invoice ID
Customer type
Member                501
Normal                499

In [ ]:
#La composicion en porcentaje de cada categoria en la variable
categorical_data['Customer type'].value_counts(normalize=True)

Member    0.501
Normal    0.499
Name: Customer type, dtype: float64

In [ ]:
categorical_data.loc[:,('Invoice ID','City')].groupby(['City']).count()

           Invoice ID
City
Mandalay          332
Naypyitaw         328
Yangon            340

In [ ]:
categorical_data['City'].value_counts(normalize=True)

Yangon       0.340
Mandalay     0.332
Naypyitaw    0.328
Name: City, dtype: float64

In [ ]:
categorical_data.loc[:,('Invoice ID','Gender')].groupby(['Gender']).count()

        Invoice ID
Gender
Female         501
Male           499

In [ ]:
categorical_data['Gender'].value_counts(normalize=True)

Female    0.501
Male      0.499
Name: Gender, dtype: float64

## **Es probable que nuestro dataframe contenga duplicados vamos a verificar**

In [12]:
categorical_data['Product line'].value_counts()

Fashion accessories       178
Food and beverages        174
Electronic accessories    170
Sports and travel         166
Home and lifestyle        160
Health and beauty         152
Name: Product line, dtype: int64

In [11]:
categorical_data['Product line'].value_counts(normalize=True)

Fashion accessories       0.178
Food and beverages        0.174
Electronic accessories    0.170
Sports and travel         0.166
Home and lifestyle        0.160
Health and beauty         0.152
Name: Product line, dtype: float64

In [14]:
# Numero total de filas y columnas
df_super.shape

(1000, 17)

In [16]:
df_super.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [20]:
# Rows containing duplicate data
duplicate_rows_df = df_super[df_super.duplicated()]
print(duplicate_rows_df.shape)

(0, 17)